

<template>
<div class="backmain">
    <div class="core">
        <div class="core-left">
            <invitation v-for="it in invitations" :key="it.id" :item="it"></invitation>
        </div>
        <div class="core-right">
            <img src="../assets/images/core-right.png" alt="">
        </div>
    </div>
</div>

</template>

<script setup>
import {ref,reactive, onMounted} from 'vue';
import Invitation from '../components/Invitation.vue';
const invitations=reactive([
{
    id:1,
    title:'终于挺过来了',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:'https://img1.baidu.com/it/u=307074048,654359288&fm=253&fmt=auto&app=120&f=JPEG?w=889&h=500',
    heat:32.5,
    author:'一缕阳光',
    discuss:21,
    collect:23
},
{
    id:2,
    title:'生病后家将不家了',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:'https://img0.baidu.com/it/u=1617940732,1879989235&fm=253&fmt=auto&app=138&f=JPEG?w=889&h=500',
    heat:34.2,
    author:'洋木说',
    discuss:21,
    collect:23
},
{
    id:3,
    title:'见识了发红包者的真面目',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:null,
    heat:32.3,
    author:'平静之美',
    discuss:21,
    collect:23
},
{
    id:4,
    title:'恢复期，我就是吃和睡',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:"https://img1.baidu.com/it/u=307074048,654359288&fm=253&fmt=auto&app=120&f=JPEG?w=889&h=500",
    heat:51.2,
    author:'www王玮',
    discuss:21,
    collect:23
},
{
    id:5,
    title:'我辞职了，我又没有工作了',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    heat:64.1,
    img:null,
    author:'小灵芝',
    discuss:21,
    collect:23
},
{
    id:6,
    title:'泡脚才发现的严重问题',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:null,
    heat:31.2,
    author:'王小线',
    discuss:21,
    collect:23
},{
    id:7,
    title:'如果让我静静地写',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:'https://img1.baidu.com/it/u=307074048,654359288&fm=253&fmt=auto&app=120&f=JPEG?w=889&h=500',
    heat:76.2,
    author:'北方竹子',
    discuss:21,
    collect:23
}
,{
    id:8,
    title:'同事抑郁了',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:null,
    heat:64.5,
    author:'www王玮',
    discuss:21,
    collect:23
}
,{
    id:9,
    title:'同事抑郁了',
    describe:'世界帝国之路宛如修仙，百年一天劫，过了劫难就脱胎换骨，再威压万国一个世纪，过不了就原形毕露，回老家种田养马。为何百年一劫？首先是地理边界问题，世界是个有限球面，扩张到一定程度，圈进来的可剥削领土就不再增加了。而为了扩张建立的军政商集团却有自己的发展惯性，宁可借债也要养住架子，最终压垮帝国财政。其次是技术扩散问题，世界帝国必然把先进技术带给被征服领土，第一代打工，第二代学习，第三代没了敬畏发起挑战，百年国运也就到头了。所以，从理论上说，只有产业升级一条路能破这两道百年天劫——产业革命之后，经济有指数增长，根本不在乎上一个时代借的债——产业革命意味着连续进步，让你随便学，也只能跟在后面吃尾气。回望历史，能修到世界帝国这一步的国家，不过5个，字面意思的“屈指可数”。其中仅有英国靠瓦特史蒂芬森破过一次百年天劫。现在马斯克之流能不能帮美国渡劫，就看今后几年甚至几个月了。',
    img:'https://img0.baidu.com/it/u=1617940732,1879989235&fm=253&fmt=auto&app=138&f=JPEG?w=889&h=500',
    heat:87.5,
    author:'小灵芝',
    discuss:21,
    collect:23
}
])
</script>
<style  scoped>

.backmain{
    width: 100%;
}
.core{
    width: 960px;
    margin-left: auto;
    margin-right: auto;
    display: flex;
    flex-direction: row;
    justify-content: space-between;
}
.core-left{
    margin-top: 20px;
    display: flex;
    flex-direction: column;
    align-items: center;
   
}
</style>